{
  "Comment": "Written by artificial stupidity.",
  "Name": "cp",
  "Description": "The command copies files and directories from a source to a target location.",
  "Arguments": [
    [
      {
        "Name": "R",
        "Optional": true,
        "Description": "The \u0060-R\u0060 argument copies directories and their entire subtree.",
        "Type": "Flag"
      },
      {
        "Name": "H",
        "Optional": true,
        "Description": "The \u0060-H\u0060 argument allows for the following of symbolic links when copying files in specific scenarios.",
        "Type": "Flag"
      },
      {
        "Name": "L",
        "Optional": true,
        "Description": "The \u0060-L\u0060 argument allows symbolic links to be followed during file copying.",
        "Type": "Flag"
      },
      {
        "Name": "P",
        "Optional": true,
        "Description": "The \u0060-P\u0060 option prevents symbolic links from being followed during the copying process.",
        "Type": "Flag"
      },
      {
        "Name": "f",
        "Optional": true,
        "Description": "The \u0060-f\u0060 argument allows for the creation of a new file without prompting for confirmation, overriding any existing permissions.",
        "Type": "Flag"
      },
      {
        "Name": "n",
        "Optional": true,
        "Description": "Prevents overwriting an existing file.",
        "Type": "Flag"
      },
      {
        "Name": "a",
        "Optional": true,
        "Description": "The \u0060-a\u0060 argument preserves the structure and attributes of files but not the directory structure.",
        "Type": "Flag"
      },
      {
        "Name": "c",
        "Optional": true,
        "Description": "The \u0060-c\u0060 option copies files using a specific system call, falling back to an alternative method if not supported.",
        "Type": "Flag"
      },
      {
        "Name": "i",
        "Optional": true,
        "Description": "Prompts before overwriting existing files during copying.",
        "Type": "Flag"
      },
      {
        "Name": "l",
        "Optional": true,
        "Description": "Create hard links to regular files in a hierarchy instead of copying.",
        "Type": "Flag"
      },
      {
        "Name": "p",
        "Optional": true,
        "Description": "Preserves various attributes and permissions of the source files during the copy process.",
        "Type": "Flag"
      },
      {
        "Name": "S",
        "Description": "The \u0060-S\u0060 argument prevents the preservation of holes in sparse files during copying.",
        "Type": "Flag"
      },
      {
        "Name": "s",
        "Optional": true,
        "Description": "Create symbolic links to regular files in a hierarchy instead of copying them.",
        "Type": "Flag"
      },
      {
        "Name": "v",
        "Optional": true,
        "Repeat": true,
        "Description": "The \u0060-v\u0060 argument displays files as they are copied.",
        "Type": "Flag"
      },
      {
        "Name": "X",
        "Optional": true,
        "Description": "The \u0060-X\u0060 argument excludes the copying of Extended Attributes (EAs) or resource forks.",
        "Type": "Flag"
      },
      {
        "Name": "x",
        "Optional": true,
        "Description": "The \u0060-x\u0060 argument prevents traversal of file system mount points.",
        "Type": "Flag"
      },
      {
        "Name": "pathname",
        "Optional": true,
        "Repeat": true,
        "Description": "The path argument specifies the location of the source file or directory to be copied and the destination where the copy will be placed.",
        "Type": "FileSystemEntry"
      }
    ]
  ]
}