{
  "Comment": "This command info is generated from fig",
  "Name": "psql",
  "Description": "Psql is a terminal-based front-end to PostgreSQL",
  "Arguments": [
    {
      "Arguments": [
        {
          "Name": "-a",
          "Description": "Print all nonempty input lines to standard output as they are read. (This does not apply to lines read interactively.) This is equivalent to setting the variable ECHO to all",
          "Aliases": [
            "--echo-all"
          ],
          "Arguments": []
        },
        {
          "Name": "-A",
          "Description": "Switches to unaligned output mode. (The default output mode is aligned.) This is equivalent to pset format unaligned",
          "Aliases": [
            "--no-align"
          ],
          "Arguments": []
        },
        {
          "Name": "-b",
          "Description": "Print failed SQL commands to standard error output. This is equivalent to setting the variable ECHO to errors",
          "Aliases": [
            "--echo-errors"
          ],
          "Arguments": []
        },
        {
          "Name": "-c",
          "Description": "Specifies that psql is to execute the given command string, command. This option can be repeated and combined in any order with the -f option. When either -c or -f is specified, psql does not read commands from standard input; instead it terminates after processing all the -c and -f options in sequence",
          "Aliases": [
            "--command"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "command",
                  "Description": "command",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "--csv",
          "Description": "Switches to CSV (Comma-Separated Values) output mode. This is equivalent to \\pset format csv",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "-d",
          "Description": "Specifies the name of the database to connect to. This is equivalent to specifying dbname as the first non-option argument on the command line. The dbname can be a connection string. If so, connection string parameters will override any conflicting command line options",
          "Aliases": [
            "--dbname"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "dbname",
                  "Description": "dbname",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "-e",
          "Description": "Copy all SQL commands sent to the server to standard output as well. This is equivalent to setting the variable ECHO to queries",
          "Aliases": [
            "--echo-queries"
          ],
          "Arguments": []
        },
        {
          "Name": "-E",
          "Description": "Echo the actual queries generated by d and other backslash commands. You can use this to study psql\u0027s internal operations. This is equivalent to setting the variable ECHO_HIDDEN to on",
          "Aliases": [
            "--echo-hidden"
          ],
          "Arguments": []
        },
        {
          "Name": "-f",
          "Description": "Read commands from the file filename, rather than standard input. This option can be repeated and combined in any order with the -c option. When either -c or -f is specified, psql does not read commands from standard input; instead it terminates after processing all the -c and -f options in sequence. Except for that, this option is largely equivalent to the meta-command i. If filename is - (hyphen), then standard input is read until an EOF indication or q meta-command. This can be used to intersperse interactive input with input from files. Note however that Readline is not used in this case (much as if -n had been specified). Using this option is subtly different from writing psql \u003C filename. In general, both will do what you expect, but using -f enables some nice features such as error messages with line numbers. There is also a slight chance that using this option will reduce the start-up overhead. On the other hand, the variant using the shell\u0027s input redirection is (in theory) guaranteed to yield exactly the same output you would have received had you entered everything by hand",
          "Aliases": [
            "--file"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "filename",
                  "Description": "filename",
                  "Type": "FileSystemEntry"
                }
              ]
            }
          ]
        },
        {
          "Name": "-F",
          "Description": "Use separator as the field separator for unaligned output. This is equivalent to \\pset fieldsep or \\f",
          "Aliases": [
            "--field-separator"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "separator",
                  "Description": "separator",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "-h",
          "Description": "Specifies the host name of the machine on which the server is running. If the value begins with a slash, it is used as the directory for the Unix-domain socket",
          "Aliases": [
            "--host"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "hostname",
                  "Description": "hostname",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "-H",
          "Description": "Switches to HTML output mode. This is equivalent to \\pset format html or the \\H command",
          "Aliases": [
            "--html"
          ],
          "Arguments": []
        },
        {
          "Name": "-l",
          "Description": "List all available databases, then exit. Other non-connection options are ignored. This is similar to the meta-command list. When this option is used, psql will connect to the database postgres, unless a different database is named on the command line (option -d or non-option argument, possibly via a service entry, but not via an environment variable)",
          "Aliases": [
            "--list"
          ],
          "Arguments": []
        },
        {
          "Name": "-L",
          "Description": "Write all query output into file filename, in addition to the normal output destination",
          "Aliases": [
            "--log-file"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "filename",
                  "Description": "filename",
                  "Type": "Directory"
                }
              ]
            }
          ]
        },
        {
          "Name": "-n",
          "Description": "Do not use Readline for line editing and do not use the command history. This can be useful to turn off tab expansion when cutting and pasting",
          "Aliases": [
            "--no-readline"
          ],
          "Arguments": []
        },
        {
          "Name": "-o",
          "Description": "Put all query output into file filename. This is equivalent to the command \\o",
          "Aliases": [
            "--output"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "filename",
                  "Description": "filename",
                  "Type": "Directory"
                }
              ]
            }
          ]
        },
        {
          "Name": "-p",
          "Description": "Specifies the TCP port or the local Unix-domain socket file extension on which the server is listening for connections. Defaults to the value of the PGPORT environment variable or, if not set, to the port specified at compile time, usually 5432",
          "Aliases": [
            "--port"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "port",
                  "Description": "port",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "-P",
          "Description": "Specifies printing options, in the style of \\pset. Note that here you have to separate name and value with an equal sign instead of a space. For example, to set the output format to LaTeX, you could write -P format=latex",
          "Aliases": [
            "--pset"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "assignment",
                  "Description": "assignment",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "-q",
          "Description": "Specifies that psql should do its work quietly. By default, it prints welcome messages and various informational output. If this option is used, none of this happens. This is useful with the -c option. This is equivalent to setting the variable QUIET to on",
          "Aliases": [
            "--quiet"
          ],
          "Arguments": []
        },
        {
          "Name": "-R",
          "Description": "Use separator as the record separator for unaligned output. This is equivalent to \\pset recordsep",
          "Aliases": [
            "--record-separator"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "separator",
                  "Description": "separator",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "-s",
          "Description": "Run in single-step mode. That means the user is prompted before each command is sent to the server, with the option to cancel execution as well. Use this to debug scripts",
          "Aliases": [
            "--single-step"
          ],
          "Arguments": []
        },
        {
          "Name": "-S",
          "Description": "Runs in single-line mode where a newline terminates an SQL command, as a semicolon does",
          "Aliases": [
            "--single-line"
          ],
          "Arguments": []
        },
        {
          "Name": "-t",
          "Description": "Turn off printing of column names and result row count footers, etc. This is equivalent to \t or pset tuples_only",
          "Aliases": [
            "--tuples-only"
          ],
          "Arguments": []
        },
        {
          "Name": "-T",
          "Description": "Specifies options to be placed within the HTML table tag. See \\pset tableattr for details",
          "Aliases": [
            "--table-attr"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "table_options",
                  "Description": "table_options",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "-U",
          "Description": "Turn off printing of column names and result row count footers, etc. This is equivalent to \t or pset tuples_only",
          "Aliases": [
            "--username"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "username",
                  "Description": "username",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "-v",
          "Description": "Perform a variable assignment, like the set meta-command. Note that you must separate name and value, if any, by an equal sign on the command line. To unset a variable, leave off the equal sign. To set a variable with an empty value, use the equal sign but leave off the value. These assignments are done during command line processing, so variables that reflect connection state will get overwritten later",
          "Aliases": [
            "--set",
            "--variable"
          ],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "username",
                  "Description": "username",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "-V",
          "Description": "Print the psql version and exit",
          "Aliases": [
            "--version"
          ],
          "Arguments": []
        },
        {
          "Name": "-w",
          "Description": "Never issue a password prompt. If the server requires password authentication and a password is not available from other sources such as a .pgpass file, the connection attempt will fail. This option can be useful in batch jobs and scripts where no user is present to enter a password. Note that this option will remain set for the entire session, and so it affects uses of the meta-command connect as well as the initial connection attempt",
          "Aliases": [
            "--no-password"
          ],
          "Arguments": []
        },
        {
          "Name": "-W",
          "Description": "Force psql to prompt for a password before connecting to a database, even if the password will not be used. If the server requires password authentication and a password is not available from other sources such as a .pgpass file, psql will prompt for a password in any case. However, psql will waste a connection attempt finding out that the server wants a password. In some cases it is worth typing -W to avoid the extra connection attempt. Note that this option will remain set for the entire session, and so it affects uses of the meta-command connect as well as the initial connection attempt",
          "Aliases": [
            "--password"
          ],
          "Arguments": []
        },
        {
          "Name": "-x",
          "Description": "Turn on the expanded table formatting mode. This is equivalent to \\x or \\pset expanded",
          "Aliases": [
            "--expanded"
          ],
          "Arguments": []
        },
        {
          "Name": "-X",
          "Description": "Do not read the start-up file (neither the system-wide psqlrc file nor the user\u0027s ~/.psqlrc file)",
          "Aliases": [
            "--no-psqlrc"
          ],
          "Arguments": []
        },
        {
          "Name": "-z",
          "Description": "Set the field separator for unaligned output to a zero byte. This is equivalent to pset fieldsep_zero",
          "Aliases": [
            "--field-separator-zero"
          ],
          "Arguments": []
        },
        {
          "Name": "-0",
          "Description": "Set the record separator for unaligned output to a zero byte. This is useful for interfacing, for example, with xargs -0. This is equivalent to pset recordsep_zero",
          "Aliases": [
            "--record-separator-zero"
          ],
          "Arguments": []
        },
        {
          "Name": "-1",
          "Description": "This option can only be used in combination with one or more -c and/or -f options. It causes psql to issue a BEGIN command before the first such option and a COMMIT command after the last one, thereby wrapping all the commands into a single transaction. This ensures that either all the commands complete successfully, or no changes are applied. If the commands themselves contain BEGIN, COMMIT, or ROLLBACK, this option will not have the desired effects. Also, if an individual command cannot be executed inside a transaction block, specifying this option will cause the whole transaction to fail",
          "Aliases": [
            "--single-transaction"
          ],
          "Arguments": []
        },
        {
          "Name": "-?",
          "Description": "Show help about psql and exit",
          "Aliases": [
            "--help"
          ],
          "Arguments": []
        }
      ],
      "Optional": true
    },
    {
      "Arguments": [
        {
          "Name": "String",
          "Description": "",
          "Type": "String"
        }
      ]
    }
  ]
}