{
  "Comment": "Written by artificial stupidity.",
  "Name": "rm",
  "Description": "The command removes specified non-directory type files from the system.",
  "Arguments": [
    [
      {
        "Name": "",
        "Optional": true,
        "Description": "Allows removal of non-directory type files with various options for confirmation and handling different scenarios."
      },
      {
        "Name": "f",
        "Optional": true,
        "Description": "Attempt to remove files without prompting for confirmation, regardless of file permissions or existence.",
        "Type": "Flag"
      },
      {
        "Name": "i",
        "Optional": true,
        "Repeat": true,
        "Description": "Request confirmation before attempting to remove each file, regardless of the file\u0027s permissions or whether the standard input device is a terminal.",
        "Type": "Flag"
      },
      {
        "Name": "d",
        "Optional": true,
        "Description": "Attempt to remove directories as well as other types of files.",
        "Type": "Flag"
      },
      {
        "Name": "I",
        "Optional": true,
        "Description": "Request confirmation once if more than three files are being removed or if a directory is being recursively removed.",
        "Type": "Flag"
      },
      {
        "Name": "P",
        "Optional": true,
        "Description": "The \u0060-P\u0060 argument does not have any effect in the \u0060rm\u0060 command as of FreeBSD 13 and may be removed in the future.",
        "Type": "Flag"
      },
      {
        "Name": "R",
        "Optional": true,
        "Description": "Attempt to remove the file hierarchy rooted in each specified file argument.",
        "Type": "Flag"
      },
      {
        "Name": "r",
        "Optional": true,
        "Repeat": true,
        "Description": "The \u0060-r\u0060 argument recursively removes the file hierarchy rooted in each file argument.",
        "Type": "Flag"
      },
      {
        "Name": "v",
        "Optional": true,
        "Description": "The \u0060-v\u0060 argument displays files as they are being removed.",
        "Type": "Flag"
      },
      {
        "Name": "W",
        "Optional": true,
        "Description": "The \u0060-W\u0060 argument attempts to undelete named files, primarily for files covered by whiteouts in a union file system.",
        "Type": "Flag"
      },
      {
        "Name": "x",
        "Optional": true,
        "Description": "The \u0060-x\u0060 argument prevents the removal of files across mount points.",
        "Type": "Flag"
      },
      {
        "Name": "",
        "Description": "The command removes directory entries and non-directory type files specified on the command line."
      },
      {
        "Name": "pathname",
        "Optional": true,
        "Repeat": true,
        "Description": "The path argument passed to the command specifies the files or directories to be removed.",
        "Type": "FileSystemEntry"
      }
    ]
  ]
}