{
  "Comment": "This command info is generated from fig",
  "Name": "caffeinate",
  "Description": "Prevent the system from sleeping on behalf of a utility",
  "Arguments": [
    {
      "Arguments": [
        {
          "Name": "d",
          "Description": "Create an assertion to prevent the display from sleeping",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "i",
          "Description": "Create an assertion to prevent the system from idle sleeping",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "m",
          "Description": "Create an assertion to prevent the disk from idle sleeping",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "s",
          "Description": "Create an assertion to prevent the system from sleeping. This assertion is valid only when system is running on AC power",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "u",
          "Description": "Create an assertion to declare that user is active. If the display is off, this option turns the display on and prevents the display from going into idle sleep. If a timeout is not specified with \u0027-t\u0027 option, then this assertion is taken with a default of 5 second timeout",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "t",
          "Description": "Specifies the timeout value in seconds for which this assertion has to be valid. The assertion is dropped after the specified timeout. Timeout value is not used when an utility is invoked with this command",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "time",
                  "Description": "time",
                  "Type": "String"
                }
              ]
            }
          ]
        },
        {
          "Name": "w",
          "Description": "Waits for the process with the specified pid to exit. Once the the process exits, the assertion is also released.  This option is ignored when used with utility option",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": [
            {
              "Arguments": [
                {
                  "Name": "pid",
                  "Description": "pid",
                  "Type": "String"
                }
              ]
            }
          ]
        }
      ],
      "Optional": true
    }
  ]
}