{
  "Comment": "This command info is generated from fig",
  "Name": "chmod",
  "Description": "Change file modes or Access Control Lists",
  "Arguments": [
    {
      "Arguments": [
        {
          "Name": "f",
          "Description": "Do not display a diagnostic message if chmod could not modify the mode for file, nor modify the exit status to reflect such failures",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "H",
          "Description": "If the -R option is specified, symbolic links on the command line are followed and hence unaffected by the command.  (Symbolic links encountered during tree traversal are not followed.)",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "h",
          "Description": "If the file is a symbolic link, change the mode of the link itself rather than the file that the link points to",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "L",
          "Description": "If the -R option is specified, all symbolic links are followed",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "P",
          "Description": "If the -R option is specified, no symbolic links are followed. This is the default",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "R",
          "Description": "Change the modes of the file hierarchies rooted in the files, instead of just the files themselves. Beware of unintentionally matching the \u0060\u0060..\u0027\u0027 hard link to the parent directory when using wildcards like \u0060\u0060.*\u0027\u0027",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        },
        {
          "Name": "v",
          "Description": "Cause chmod to be verbose, showing filenames as the mode is modified. If the -v flag is specified more than once, the old and new modes of the file will also be printed, in both octal and symbolic notation",
          "Type": "Flag",
          "Aliases": [],
          "Arguments": []
        }
      ],
      "Optional": true
    },
    {
      "Arguments": [
        {
          "Name": "mode",
          "Description": "mode",
          "Type": "String"
        },
        {
          "Name": "u\u002Bx",
          "Description": "Give execute permission for the user"
        },
        {
          "Name": "a\u002Brx",
          "Description": "Adds read and execute permissions for all classes"
        },
        {
          "Name": "744",
          "Description": "Sets read, write, and execute permissions for user, and sets read permission for Group and Others"
        },
        {
          "Name": "664",
          "Description": "Sets read and write permissions for user and Group, and provides read to Others"
        },
        {
          "Name": "777",
          "Description": "⚠️ allows all actions for all users"
        }
      ]
    },
    {
      "Arguments": [
        {
          "Name": "FileSystemEntry",
          "Description": "",
          "Type": "FileSystemEntry"
        }
      ]
    }
  ]
}